/*
 *   증감 연산자
 *   int a = 10;
 *   a++; => a = a+1 ==> a += 1
 *   --- 1개증가, 1개감소   ==> 반복문에서 주로 사용
 *         ++     --
 *   = 전치연산자
 *     ++a , --a
 *   = 후치연산자
 *     a++ , a--
 *   ------------------------------------------------
 *   int a=10;
 *   int b = ++a; ==> a를 먼저 증가하고 b에 대입
 *           ---
 *            1
 *      ---
 *       2
 *   ==> a=11 , b=11
 *   
 *   int a = 10;
 *   int b = a++; ==> b에 a값을 대입 후에 나중에 a값을 증가
 *      ---
 *       1
 *           ---
 *            2
 *   ==> a = 11 , b = 10
 *   
 *   int a = 10;
 *   int b = ++a + ++a + a++   ==> a값은 증가된 수만큼 a = 13
 *           ---   ---   ---
 *           11    12    12   => b = 35
 *           
 *   int a = 10;
 *   int b = a++ + a++ + ++a;   a = 14
 *           ---   ---   ---
 *            10    11   13   => b = 34
 *            
 *   int a = 10;
 *           11     11   13    13    => b = 48
 *   int b = ++a + a++ + ++a + a++   ==> a = 14
 *   
 *   int a = 10;
 *            10   11    12    13   ==> b = 46
 *   int b = a++ + a++ + a++ + a++  ==> a = 14
 *   
 *   int a = 10;
 *           10    9     9      9   ==> b =  37
 *   int b = a-- + a++ + --a + a++  ==> a = 10
 *   ------------------------------------------
 *            
 */
public class 증감연산자_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		int a=10;
		int b=++a; // 전치연산자
		System.out.println("a="+a+", b="+b);
		
		a=10;
		b=a++; // 후치연산자
		System.out.println("a="+a+", b="+b);
	}

}
