/*
		면접
		---
		함수(C) VS 메소드(Java)
		-------------------- 한가지 기능을 수행
		함수 : 독립적으로 사용 
		메소드 : 클래스 종속 (클래스 안 = 메소드, 클래스 밖 = 함수)
		---------------- 메소드는 종료하는 시점이 있다 ==> return(메소드)
		배열 / 메소드
		----------- 클래스 
		            ---- 객체지향에 맞게 변경 
		            	 데이터 보호 (캡슐화)
		            	 재사용 (상속,포함)
		            	     is-a , has-a
		            	 수정, 추가 
		            	 ***오버라이딩(modify) , 오버로딩(new)
		            	 ==> 유지보수가 쉽게 제작
*/
public class 제어문_반복제어문4 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		return; // void를 하면 return 안써도 컴파일할 때 자동으로 추가된다. (컴파일러가 추가)
	}

}
